content-org/blog.org
#+HUGO_BASE_DIR: ../
** Project Euler 2: Even Fibonacci Numbers                 :@math:fibonacci:
:PROPERTIES:
:EXPORT_FILE_NAME: 2
:EXPORT_DATE: 2018-06-10
:EXPORT_DESCRIPTION: My Python solution and code for Project Euler 2 on Project Euler.
:END:
*** Problem Statement
Each new term in the Fibonacci sequence is generated by adding the previous two
terms. By starting with 1 and 2, the first 10 terms will be:
\begin{equation*}
	1, 2, 3, 5, 8, 13, 21, 34, 55, 89,\ldots
\end{equation*}
Find the sum of the even-valued terms in the Fibonacci sequence not exceeding $N$.
*** My Algorithm
For the Project Euler problem, $N = 4\times10^6$. Let's list the Fibonacci
numbers with $F(0) = 0$:
\begin{equation}
	0,1,1,2,3,5,8,13,21,\ldots
\end{equation}
Using the definition of the Fibonacci sequence:
\begin{equation}
	\begin{split}
		F(n+3) &= F(n + 2) + F(n + 1) \\
		&= F(n + 1) + F(n) + F(n + 1) \\
		&= 2F(n + 1) + F(n).
	\end{split}
	\label{fib-sum}
\end{equation}
This shows that if $F(n)$ is even, then so is $F(n+3)$. Because $F(0) = 0$ is
even, then the even Fibonacci numbers are $F(3k)$ for positive integers $k$.

Further applying the Fibonacci recurrence relation gives
\begin{equation}
	\begin{split}
		F(3k) &= 2F(3k - 2) + F(3k - 3) \\
		&= 3F(3k - 3) + 2F(3k - 4) \\
		&= 3F(3k - 3) + 2F(3k - 5) + 2F(3k - 6).
	\end{split}
\end{equation}
From \eqref{fib-sum}, we have $F(3k - 3) = 2F(3k - 5) + F(3k - 6)$, so
\begin{equation}
	F(3k) = 4F(3k - 3) + F(3k - 6) = 4F(3(k-1)) + F(3(k-2)).
	\label{next-fib}
\end{equation}
To solve the problem, we begin with $0,2$. Using \eqref{next-fib}, we add to a
sum the next even Fibonacci number, keeping track of the last two even Fibonacci
numbers. We continue this until the next even Fibonacci number exceeds $N$. This
solution performs one-third as many steps as there are Fibonacci numbers up to
$N$, so it is $O(\log n)$.
**** Other Solutions
Only computing even Fibonacci numbers does not change the
time complexity of the solution, but it does shave off a constant factor of 3.
**** Mathematical Solution
A more mathematically oriented $O(1)$ solution (my personal favourite) is also
possible. Unfortunately, the floating point calculations involved become too
inaccurate with large values of $N$, and using a high precision floating point
library (such as Python's ~decimal~) is too slow. Regardless, a famous formula
for the value of the $n$-th Fibonacci number is Binet's formula:
\begin{equation}
	F(n) = \frac{\varphi^n - (-\varphi)^{-n}}{\sqrt{5}}.
\end{equation}

Suppose we know that we need to sum the Fibonacci numbers $F(3k)$ for integers
$k$ from 0 to some maximum $M$ to get our desired sum $S$. Then we have two
geometric series:
\begin{equation}
	S = \frac{1}{\sqrt{5}}\left(\sum_{k=0}^M \varphi^{3k} - \sum_{k=0}^M (-\varphi)^{-(3k)}\right).
	\label{sum}
\end{equation}
We can find the first term of each series by setting $k = 0$; they are both 1.
In the first series, the common ratio is $\varphi^3$, in the second
$(-\varphi)^{-3}$. We use the formula for the [[https://en.wikipedia.org/wiki/Geometric_series#Formula][sum of a geometric series]] with
first term $a$ and common ratio $r$ with $n$ terms:
\begin{equation}
	a + ar + ar^3 + \cdots + ar^{n-1} = a\left(\frac{r^n - 1}{r-1}\right).
\end{equation}
Now we can rewrite \eqref{sum}, noting that each sum contains the first $M+1$
terms of a geometric series:
\begin{equation}
	S = \frac{1}{\sqrt{5}}\left( \frac{\varphi^{3(M+1)} - 1}{\varphi^3 - 1} + \frac{(-\varphi)^{-3(M+1)} - 1}{\varphi^{-3} + 1} \right).
	\label{sum2}
\end{equation}
It's nice to have from a mathematical point of view, but the second term in
\eqref{sum2} quickly vanishes. Excluding it gives an absolute error of less than
1, so we can ignore it and floor the expression:
\begin{equation}
	S = \left\lfloor \frac{\varphi^{3(M+1)} - 1}{\sqrt{5}(\varphi^3 - 1)} \right\rfloor.
\end{equation}

Now we need to find what this maximum $M$ actually is. We know that $F(3M)$ is
the largest even Fibonacci number less than or equal to $N$. Using the truncated
version of Binet's formula, we know that
\begin{equation}
	F(n) \approx \frac{\varphi^n}{\sqrt{5}},
\end{equation}
so $n \approx \log_\varphi(\sqrt{5} F(n))$. Therefore, $M \approx
\left\lfloor\frac{1}{3}\log_\varphi(N\sqrt{5})\right\rfloor$. And so our desired
answer is
\begin{equation}
	S = \left\lfloor \frac{\varphi^{3\left(\left\lfloor\frac{1}{3}\log_\varphi(N\sqrt{5})\right\rfloor+1\right)} - 1}{\sqrt{5}(\varphi^3 - 1)} \right\rfloor.
\end{equation}
